# 批量改變數名 shift F6

# B = 4.56
#
# print(type(B))
# print(id(B))
# print(B)

# ------------------------------------------------------

# a = 10
# print(id(a))
# a = a + 3
# print(id(a))
# b = 13
# print(id(b))


# ------------------------------------------------------

# L = [10, 20, 30]
# print(id(L))
# L[0] = 11
# print(L)
#
# m = L
# print(id(m))
# m[1] = 21
#
# print(m)
# print(L)
#
# print(id(L[0]))
# print(id(L[1]))
# print(id(m[1]))
# print(type(L))
# print(type(L[0]))

# ------------------------------------------------------

# a = 1+2j
# b = 3+4j
# print(a.real, a.imag)
# a = 1
# b = 2.
# print(type(a+b))

# ------------------------------------------------------

# s = 'abcdeabcdef'
# print(s[0:2])
# print(s[:])
# print(s[:4])
# print(s[:-1])
# print(s[-1])
# print(s.index('a'))
# print(s.count('b'))
# print(len(s))
# print('a' in s)

# ------------------------------------------------------

#  改了b之後e不會跟著改

# a = [2, 3, 4]
# b = [6, 7, 8.5, 'xyz']
# c = []
# d = [2, [a, b]]
# e = a + b
#
# print(a[1])
# print(b[1:3])
# print(d[1][0][2])
# b[0] = 4
# print(b)
# print(e)

# ------------------------------------------------------

# f = (2, 3, 4, 5)
# g = ()
# h = (2, [3, 4], (10, 11, 12))
# print(f[1])
# print(f[1:3])
# print(h[1][1])

# ------------------------------------------------------

# s1 = {1, 2, 3, 1, 1, 2, 3, 4, 5, 1}
# s2 = {5, 3, 2, 1, 2, 1, 4}
#
# print(s1)
# print(s2)
# print(s1 == s2)
# print(s1 is s2)

# ------------------------------------------------------

# D = {}
# D['G'] = 'google'
# D['Y'] = 'youtube'
# D['F'] = 'facebook'
# print(D['G'])

# ------------------------------------------------------

# x = 100
# a = str(x)
#
# print(x)
# print(a)

# ------------------------------------------------------

# input_args = eval(input("請輸入多個數字，以逗號隔開"))
# print(str(input(input_args)))